In [21]:
import cx_Oracle as cx
con=cx.connect('scott/tiger@localhost:1521/orcl')
cur=con.cursor()
l=[[1,'Test1'],[2,'Test2'],[3,'Test3'],[4,'Test4']]
for l_rec in l:
    query='insert into batch_table values('
    val=l_rec[0]
    val1=l_rec[1]
    query=query + str(val) +','+'\''+str(val1)+'\')'
    cur.execute(query)
con.commit()
con.close()

In [1]:
l=[[1,'Test1'],[2,'Test2'],[3,'Test3'],[4,'Test4']]

In [28]:
for l_rec in l:
    #print(l_rec)
    query='insert into batch_table values('
    val=l_rec[0]
    val1=l_rec[1]
    query=query + str(val) +','+'\''+str(val1)+'\')'
    print(query)

insert into batch_table values(1,'Test1')
insert into batch_table values(2,'Test2')
insert into batch_table values(3,'Test3')
insert into batch_table values(4,'Test4')

In [27]:
'ram\'''s'

"ram's"

In [59]:
#t_rec=[(5,'Test5',9000),(6,'Test6',10000),(7,'Test7',50000),(8,'Test8',8000)]
t_rec=[(5,'Test5'),(6,'Test6'),(7,'Test7'),(8,'Test8')]
t_rec1=[(15,),(16,),(17,),(18,)]

In [54]:
import cx_Oracle as cx
con=cx.connect('scott/tiger@localhost:1521/orcl')
cur=con.cursor()
cur.executemany('insert into batch_table values(:1,:2)',t_rec)
con.commit()

In [62]:
import cx_Oracle as cx
con=cx.connect('scott/tiger@localhost:1521/orcl')
cur=con.cursor()
cur.executemany('insert into batch_table (id) values(:1)',t_rec1)
con.commit()
con.close()

In [60]:
for t in t_rec1:
    print(t)

(15,)
(16,)
(17,)
(18,)

In [64]:
import cx_Oracle as cx
con=cx.connect('scott/tiger@localhost:1521/orcl')
cur=con.cursor()
cur.execute('select * from emp where sal is not null order by sal desc')
for c in cur:
    print(c)
con.commit()
con.close()

(1100, 'NEIL', 'ANALYST', 7839, datetime.datetime(2019, 11, 17, 0, 0), 6000.0, None, 20)
(1104, 'R', 'DEVELOPER', 7844, None, 5500.0, None, 10)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(1200, 'Mayank', None, None, None, 5000.0, 0.0, 40)
(1000, 'RAZA', 'ANALYST', 1100, None, 3000.0, None, 20)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1987, 4, 19, 0, 0), 3000.0, None, 20)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1987, 5, 23, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)

In [69]:
import cx_Oracle as cx
con=cx.connect('scott/tiger@localhost:1521/orcl')
cur=con.cursor()
cur.execute('select * from emp where sal is not null order by sal desc')
rec=cur.fetchone()
rec=cur.fetchone()
rec_all=cur.fetchall()
print('the record will print after the second record')
for r in rec_all:
    print(r)
print(rec)
con.commit()
con.close()

the record will print after the second record
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(1200, 'Mayank', None, None, None, 5000.0, 0.0, 40)
(1000, 'RAZA', 'ANALYST', 1100, None, 3000.0, None, 20)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1987, 4, 19, 0, 0), 3000.0, None, 20)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1987, 5, 23, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(1104, 'R', 'DEVELOPER', 7844, None, 5500.0, None, 10)

In [70]:
import pyodbc as py